app/Models/ModelScanMasuk.php

SELECT *
FROM `presensi`
LEFT JOIN `tbl_siswa` ON `tbl_siswa`.`id_siswa`=`presensi`.`id_siswa`
ORDER BY `id_presensi` DESC
 LIMIT 3
---
    public function AllDataLimit()
    {
        return $this->db->table('presensi')
            ->limit(3)
            ->join('tbl_siswa', 'tbl_siswa.id_siswa=presensi.id_siswa', 'LEFT')
            ->orderBy('id_presensi', 'DESC')
            ->get()->getResultArray();